mmazat/MeshCore/variants/esp32s3_n16r8_sx1262/target.h
#pragma once

#define RADIOLIB_STATIC_ONLY 1
#include <RadioLib.h>
#include <helpers/radiolib/RadioLibWrappers.h>
#include <helpers/radiolib/CustomSX1262Wrapper.h>
#include <helpers/AutoDiscoverRTCClock.h>
#include <helpers/SensorManager.h>
#include "ESP32S3N16R8SX1262Board.h"

extern ESP32S3N16R8SX1262Board board;
extern WRAPPER_CLASS radio_driver;
extern AutoDiscoverRTCClock rtc_clock;
extern SensorManager sensors;

bool board_capture_image_to_sd(char* path_buffer, size_t path_buffer_size, size_t* bytes_written,
                              uint16_t* out_width = nullptr, uint16_t* out_height = nullptr);
bool board_get_sd_file_size(const char* path, size_t* file_size);
bool board_compute_sd_file_crc32(const char* path, uint32_t* crc32_out);
bool board_read_sd_file_chunk(const char* path, size_t offset, uint8_t* buffer, size_t buffer_size, size_t* bytes_read);
bool radio_init();
uint32_t radio_get_rng_seed();
void radio_set_params(float freq, float bw, uint8_t sf, uint8_t cr);
void radio_set_tx_power(int8_t dbm);
mesh::LocalIdentity radio_new_identity();